TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32_tsl_multichannelkey.c
/**
  ******************************************************************************
  * @file    stm32_tsl_multichannelkey.c
  * @author  MCD Application Team
  * @version v0.1.3
  * @date    23-September-2011
  * @brief   STM32 Touch Sensing Library - This file provides the functions to
  *          manage the multi-channel keys (wheel and slider).
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_tsl_multichannelkey.h"
#include "stm32_tsl_api.h"
#include "stm32_tsl_services.h"

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

const Info_Channel * Channel_address_tab[] =
  {
    &Channel_P1
#if NUMBER_OF_ACQUISITION_PORTS > 1
    , &Channel_P2
#endif
#if NUMBER_OF_ACQUISITION_PORTS > 2
    , &Channel_P3
#endif
  };

//==============================================================================
// MCKEY1
//==============================================================================

//------------------------------------------------------------------------------
// MCKEY1 LOOK-UP TABLE FOR CHANNELS AND GROUPS CORRESPONDANCE
//------------------------------------------------------------------------------
const uint8_t MCKEY1_LOOK_TABLE[CHANNEL_PER_MCKEY][2] =
  {
    /********MCKEY1_A************/

#if MCKEY1_A_CH == SCKEY_P1_CH
    0x00
#elif MCKEY1_A_CH == SCKEY_P2_CH
    0x01
#else //MCKEY1_A_CH == SCKEY_P3_CH
    0x02
#endif

#if   (MCKEY1_A == GROUP1)
    , 0x00
#elif (MCKEY1_A == GROUP2)
    , 0x01
#elif (MCKEY1_A == GROUP3)
    , 0x02
#elif (MCKEY1_A == GROUP4)
    , 0x03
#elif (MCKEY1_A == GROUP5)
    , 0x04
#elif (MCKEY1_A == GROUP6)
    , 0x05
#elif (MCKEY1_A == GROUP7)
    , 0x06
#elif (MCKEY1_A == GROUP8)
    , 0x07
#elif (MCKEY1_A == GROUP9)
    , 0x08
#elif (MCKEY1_A == GROUP10)
    , 0x09
#endif

    /********MCKEY1_B************/

#if MCKEY1_B_CH == SCKEY_P1_CH
    , 0x00
#elif MCKEY1_B_CH == SCKEY_P2_CH
    , 0x01
#else //MCKEY1_A_CH == SCKEY_P3_CH
    , 0x02
#endif

#if   (MCKEY1_B == GROUP1)
    , 0x00
#elif (MCKEY1_B == GROUP2)
    , 0x01
#elif (MCKEY1_B == GROUP3)
    , 0x02
#elif (MCKEY1_B == GROUP4)
    , 0x03
#elif (MCKEY1_B == GROUP5)
    , 0x04
#elif (MCKEY1_B == GROUP6)
    , 0x05
#elif (MCKEY1_B == GROUP7)
    , 0x06
#elif (MCKEY1_B == GROUP8)
    , 0x07
#elif (MCKEY1_B == GROUP9)
    , 0x08
#elif (MCKEY1_B == GROUP10)
    , 0x09
#endif

    /********MCKEY1_C************/

#if MCKEY1_C_CH == SCKEY_P1_CH
    , 0x00
#elif MCKEY1_C_CH == SCKEY_P2_CH
    , 0x01
#else //MCKEY1_A_CH == SCKEY_P3_CH
    , 0x02
#endif

#if   (MCKEY1_C == GROUP1)
    , 0x00
#elif (MCKEY1_C == GROUP2)
    , 0x01
#elif (MCKEY1_C == GROUP3)
    , 0x02
#elif (MCKEY1_C == GROUP4)
    , 0x03
#elif (MCKEY1_C == GROUP5)
    , 0x04
#elif (MCKEY1_C == GROUP6)
    , 0x05
#elif (MCKEY1_C == GROUP7)
    , 0x06
#elif (MCKEY1_C == GROUP8)
    , 0x07
#elif (MCKEY1_C == GROUP9)
    , 0x08
#elif (MCKEY1_C == GROUP10)
    , 0x09
#endif

  };

//------------------------------------------------------------------------------
// MCKEY1 CONSTANT TABLES FOR POSITION CALCULATION
//------------------------------------------------------------------------------

#if MCKEY1_TYPE == 0 // Wheel
#if MCKEY1_LAYOUT_TYPE == 0 // Interlaced electrodes
const int16_t MCKEY1_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3
    //   j = 0     1     2
    0,  -64,  107, // maj = 1; i = 0
    21,    0, -107, // maj = 2; i = 1
    -149,   64,    0  // maj = 3; i = 2
  };
#define MCKEY1_SECTOR_COMPUTATION  (85)
#define MCKEY1_POSITION_CORRECTION (43)
#else // Normal electrodes
#error "MCKey with normal electrodes layout type is not supported"
#endif
#endif // Wheel
//# MCKEY1_TYPE == 0

#if MCKEY1_TYPE == 1 // Slider
#if MCKEY1_LAYOUT_TYPE == 0 // Interlaced electrodes
const int16_t MCKEY1_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3
    //   j = 0     1     2
    0,  -96,  160, // maj = 1; i = 0
    32,    0, -160, // maj = 2; i = 1
    -224,   96,    0  // maj = 3; i = 2
  };
#define MCKEY1_SECTOR_COMPUTATION  (128)
#define MCKEY1_POSITION_CORRECTION (128)
#else // Normal electrodes
#error "MCKey with normal electrodes layout type is not supported"
#endif
#endif
//# MCKEY1_TYPE == 1

//==============================================================================
// MCKEY2
//==============================================================================

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 1

//------------------------------------------------------------------------------
// MCKEY2 LOOK-UP TABLE FOR CHANNELS AND GROUPS CORRESPONDANCE
//------------------------------------------------------------------------------
const uint8_t MCKEY2_LOOK_TABLE[CHANNEL_PER_MCKEY][2] =
  {

    /********MCKEY2_A************/
#if MCKEY2_A_CH == SCKEY_P1_CH
    0x00
#else //port 2 is used
    0x01
#endif

#if   (MCKEY2_A == GROUP1)
    , 0x00
#elif (MCKEY2_A == GROUP2)
    , 0x01
#elif (MCKEY2_A == GROUP3)
    , 0x02
#elif (MCKEY2_A == GROUP4)
    , 0x03
#elif (MCKEY2_A == GROUP5)
    , 0x04
#elif (MCKEY2_A == GROUP6)
    , 0x05
#elif (MCKEY2_A == GROUP7)
    , 0x06
#elif (MCKEY2_A == GROUP8)
    , 0x07
#elif (MCKEY2_A == GROUP9)
    , 0x08
#elif (MCKEY2_A == GROUP10)
    , 0x09
#endif

    /********MCKEY2_B************/
#if MCKEY2_B_CH == SCKEY_P1_CH
    , 0x00
#else //port 2 is used
    , 0x01
#endif

#if   (MCKEY2_B == GROUP1)
    , 0x00
#elif (MCKEY2_B == GROUP2)
    , 0x01
#elif (MCKEY2_B == GROUP3)
    , 0x02
#elif (MCKEY2_B == GROUP4)
    , 0x03
#elif (MCKEY2_B == GROUP5)
    , 0x04
#elif (MCKEY2_B == GROUP6)
    , 0x05
#elif (MCKEY2_B == GROUP7)
    , 0x06
#elif (MCKEY2_B == GROUP8)
    , 0x07
#elif (MCKEY2_B == GROUP9)
    , 0x08
#elif (MCKEY2_B == GROUP10)
    , 0x09
#endif

    /********MCKEY2_C************/
#if MCKEY2_C_CH == SCKEY_P1_CH
    , 0x00
#else //port 2 is used
    , 0x01
#endif

